manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/ble/meshtastic_ble.cpp
SecureMode_t bleCharacteristicSecurityMode(const meshtastic_Config_BluetoothConfig& config)
{
    return blePairingRequiresSecurity(config) ? SECMODE_ENC_NO_MITM : SECMODE_OPEN;
}

SecureMode_t bleServiceSecurityMode(const meshtastic_Config_BluetoothConfig& config)
{
    return blePairingRequiresSecurity(config) ? SECMODE_ENC_WITH_MITM : SECMODE_OPEN;
}

bool loadFirstPeripheralBondPeer(ble_gap_addr_t* out)
{
    if (!out)
    {
        return false;
    }

    namespace lfs = Adafruit_LittleFS_Namespace;
    lfs::File dir(BOND_DIR_PRPH, lfs::FILE_O_READ, InternalFS);
    if (!dir)
    {
        return false;
    }

    lfs::File file(InternalFS);
    while ((file = dir.openNextFile(lfs::FILE_O_READ)))
    {
        if (file.isDirectory())
        {
            file.close();
            continue;
        }

        const int key_len = file.read();
        if (key_len == static_cast<int>(sizeof(bond_keys_t)))
        {
            bond_keys_t keys{};
            const int read_len = file.read(reinterpret_cast<uint8_t*>(&keys), sizeof(keys));
            const ble_gap_addr_t peer = keys.peer_id.id_addr_info;
            if (read_len == static_cast<int>(sizeof(keys)) && isIdentityBleAddressType(peer.addr_type) &&
                !isEmptyBleAddress(peer))
            {
                *out = peer;
                char peer_addr_text[24] = {};
                formatBleAddress(peer, peer_addr_text, sizeof(peer_addr_text));
                bleLogBoth("[BLE][nrf52][mt] bond peer recovered file=%s peer=%s type=%s(0x%02X)",
                           file.name(),
                           peer_addr_text,
                           bleAddressTypeName(peer.addr_type),
                           static_cast<unsigned>(peer.addr_type));
                file.close();
                dir.close();
                return true;
            }
        }

        file.close();
    }

    dir.close();
    return false;
}

const char* disconnectReasonName(uint8_t reason)
{
    switch (reason)
    {
    case BLE_HCI_STATUS_CODE_SUCCESS:
        return "success";
    case BLE_HCI_STATUS_CODE_UNKNOWN_CONNECTION_IDENTIFIER:
        return "unknown_connection";
    case BLE_HCI_AUTHENTICATION_FAILURE:
        return "auth_failure";
    case BLE_HCI_STATUS_CODE_PIN_OR_KEY_MISSING:
        return "pin_or_key_missing";
    case BLE_HCI_CONNECTION_TIMEOUT:
        return "connection_timeout";
    case BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION:
        return "remote_user";
    case BLE_HCI_REMOTE_DEV_TERMINATION_DUE_TO_LOW_RESOURCES:
        return "remote_low_resources";
    case BLE_HCI_REMOTE_DEV_TERMINATION_DUE_TO_POWER_OFF:
        return "remote_power_off";
    case BLE_HCI_LOCAL_HOST_TERMINATED_CONNECTION:
        return "local_host";
    case BLE_HCI_CONN_INTERVAL_UNACCEPTABLE:
        return "interval_unacceptable";
    case BLE_HCI_CONN_TERMINATED_DUE_TO_MIC_FAILURE:
        return "mic_failure";
    case BLE_HCI_CONN_FAILED_TO_BE_ESTABLISHED:
        return "failed_to_establish";
    default:
        return "unknown";
    }
}

const char* fromRadioEmptyReasonName(uint8_t reason)
{
    switch (reason)
    {
    case kFromRadioEmptyInactive:
        return "inactive";
    case kFromRadioEmptyNoFrame:
        return "no_frame";
    case kFromRadioEmptyInvalidFrame:
        return "invalid_frame";
    case kFromRadioEmptyNotNotified:
        return "not_notified";
    default:
        return "unknown";
    }
}

MeshtasticBleService* s_active_service = nullptr;

void onBleConnect(uint16_t conn_handle)
{
    if (s_active_service)
    {
        s_active_service->handleConnectEvent(conn_handle);
    }
}

void onBleDisconnect(uint16_t conn_handle, uint8_t reason)
{
    if (!s_active_service)
    {
        return;
    }
    s_active_service->handleDisconnectEvent(conn_handle, reason);
}

bool onPairPasskeyDisplay(uint16_t conn_handle, uint8_t const passkey[6], bool match_request)
{
    if (s_active_service)
    {
        s_active_service->handlePairPasskeyDisplay(conn_handle, passkey, match_request);
    }
    return true;
}

void onPairComplete(uint16_t conn_handle, uint8_t auth_status)
{
    if (s_active_service)
    {
        s_active_service->handlePairComplete(conn_handle, auth_status);
    }
}

void onSecured(uint16_t conn_handle)
{
    if (s_active_service)
    {
        s_active_service->handleSecured(conn_handle);
    }
}

void prepareBluefruit(const std::string& device_name)
{
    bleLogBoth("[BLE][nrf52][mt] bluefruit begin name=%s", device_name.c_str());
    Bluefruit.autoConnLed(false);
    Bluefruit.configPrphBandwidth(BANDWIDTH_MAX);
    Bluefruit.begin(1, 0);
    Bluefruit.setTxPower(4);
    Bluefruit.setName(device_name.c_str());
    Bluefruit.Periph.setConnectCallback(onBleConnect);
    Bluefruit.Periph.setDisconnectCallback(onBleDisconnect);
    Bluefruit.Periph.setConnSlaveLatency(0);
    Bluefruit.Periph.setConnInterval(12, 80);
    const ble_gap_addr_t own_addr = Bluefruit.getAddr();
    char own_addr_text[24] = {};
    formatBleAddress(own_addr, own_addr_text, sizeof(own_addr_text));
    bleLogBoth("[BLE][nrf52][mt] bluefruit ready own=%s type=%s(0x%02X) tx_power=%d conn_interval=12..80 "
               "latency=0 name=%s",
               own_addr_text,
               bleAddressTypeName(own_addr.addr_type),
               static_cast<unsigned>(own_addr.addr_type),
               static_cast<int>(Bluefruit.getTxPower()),
               device_name.c_str());
}

bool startAdvertising(::BLEService& service, const ble_gap_addr_t* directed_peer)
{
    const bool directed = directed_peer && isIdentityBleAddressType(directed_peer->addr_type) &&
                          !isEmptyBleAddress(*directed_peer);
    char peer_addr_text[24] = {};
    if (directed)
    {
        formatBleAddress(*directed_peer, peer_addr_text, sizeof(peer_addr_text));
    }

    Bluefruit.Advertising.stop();
    Bluefruit.Advertising.clearData();
    Bluefruit.ScanResponse.clearData();
    Bluefruit.Advertising.setInterval(kBleAdvertisingFastInterval, kBleAdvertisingSlowInterval);
    Bluefruit.Advertising.setFastTimeout(kBleAdvertisingFastTimeoutSec);
    if (directed)
    {
        Bluefruit.Advertising.setType(BLE_GAP_ADV_TYPE_CONNECTABLE_NONSCANNABLE_DIRECTED);
        Bluefruit.Advertising.setPeerAddress(*directed_peer);
        Bluefruit.Advertising.restartOnDisconnect(false);
        const bool ok = Bluefruit.Advertising.start(kDirectedAdvertisingMs / 1000UL);
        bleLogBoth("[BLE][nrf52][mt] advertising mode=directed peer=%s type=%s(0x%02X) running=%u ok=%u window_ms=%lu",
                   peer_addr_text,
                   bleAddressTypeName(directed_peer->addr_type),
                   static_cast<unsigned>(directed_peer->addr_type),
                   Bluefruit.Advertising.isRunning() ? 1U : 0U,
                   ok ? 1U : 0U,
                   static_cast<unsigned long>(kDirectedAdvertisingMs));
        return ok;
    }

    Bluefruit.Advertising.setType(BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED);
    const bool flags_ok = Bluefruit.Advertising.addFlags(BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE);
    const bool service_ok = Bluefruit.Advertising.addService(service);
    const bool tx_power_ok = Bluefruit.ScanResponse.addTxPower();
    const bool name_ok = Bluefruit.ScanResponse.addName();
    Bluefruit.Advertising.restartOnDisconnect(true);
    const bool ok = Bluefruit.Advertising.start(0);
    bleLogBoth("[BLE][nrf52][mt] advertising mode=undirected running=%u ok=%u restart=1 interval=%u..%u "
               "fast_timeout_s=%u adv_len=%u scan_len=%u flags=%u service=%u scan_tx_power=%u scan_name=%u",
               Bluefruit.Advertising.isRunning() ? 1U : 0U,
               ok ? 1U : 0U,
               static_cast<unsigned>(kBleAdvertisingFastInterval),
               static_cast<unsigned>(kBleAdvertisingSlowInterval),
               static_cast<unsigned>(kBleAdvertisingFastTimeoutSec),
               static_cast<unsigned>(Bluefruit.Advertising.count()),
               static_cast<unsigned>(Bluefruit.ScanResponse.count()),
               flags_ok ? 1U : 0U,
               service_ok ? 1U : 0U,
               tx_power_ok ? 1U : 0U,
               name_ok ? 1U : 0U);
    return ok;
}

void disconnectAll()
{
    for (uint8_t index = 0; index < BLE_MAX_CONNECTION; ++index)
    {
        if (Bluefruit.connected(index))
        {
            Bluefruit.disconnect(index);
        }
    }
}

void authorizeRead(uint16_t conn_handle)
{
    ble_gatts_rw_authorize_reply_params_t reply = {.type = BLE_GATTS_AUTHORIZE_TYPE_READ};
    reply.params.read.gatt_status = BLE_GATT_STATUS_SUCCESS;
    sd_ble_gatts_rw_authorize_reply(conn_handle, &reply);
}

void onToRadioWrite(uint16_t, BLECharacteristic*, uint8_t* data, uint16_t len)
{
    if (!s_active_service || !data || len == 0)
    {
        return;
    }
    (void)s_active_service->enqueueToRadio(data, len);
}

