manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/ble/meshtastic_ble.cpp
void onFromNumCccdWrite(uint16_t conn_handle, BLECharacteristic*, uint16_t value)
{
    if (s_active_service)
    {
        s_active_service->handleFromNumCccdWrite(conn_handle, value);
    }
}

void onFromRadioAuthorize(uint16_t conn_handle, BLECharacteristic* chr, ble_gatts_evt_read_t* request)
{
    if (!chr || !request)
    {
        authorizeRead(conn_handle);
        return;
    }

    if (request->offset != 0)
    {
        authorizeRead(conn_handle);
        return;
    }

    if (s_active_service)
    {
        s_active_service->handleFromRadioReadRequest(
            conn_handle, request->offset, reinterpret_cast<uintptr_t>(chr));
        return;
    }

    authorizeRead(conn_handle);
}

} // namespace

MeshtasticBleService::MeshtasticBleService(app::IAppBleFacade& ctx, const std::string& device_name)
    : phone_facade_(ctx, ble_config_, module_config_, this),
      observer_bridge_(new MeshtasticBleObserverBridge(ctx, *this)),
      device_name_(device_name),
      service_(::BLEUuid(MESH_SERVICE_UUID_128_LE)),
      to_radio_(::BLEUuid(TORADIO_UUID_128_LE)),
      from_radio_(::BLEUuid(FROMRADIO_UUID_128_LE)),
      from_num_(::BLEUuid(FROMNUM_UUID_128_LE)),
      log_radio_(::BLEUuid(LOGRADIO_UUID_128_LE))
{
    ble_config_ = meshtastic_Config_BluetoothConfig_init_zero;
    ble_config_.enabled = phone_facade_.isBleEnabled();
    ble_config_.mode = meshtastic_Config_BluetoothConfig_PairingMode_RANDOM_PIN;
    ble_config_.fixed_pin = 0;

    meshtastic_config_bridge::PersistedState persisted{};
    const bool persisted_ok = loadMeshtasticBlePersistedState(&persisted);

    bleLogBoth("[BLE][nrf52][mt] persisted load ok=%u has_bt=%u has_mod=%u",
               persisted_ok ? 1U : 0U,
               persisted.has_bluetooth ? 1U : 0U,
               persisted.has_module ? 1U : 0U);

    logMeshtasticBlePersistenceStatus();

    meshtastic_config_bridge::initializeConfigState(
        persisted, phone_facade_.isBleEnabled(), phone_facade_.getSelfNodeId(), &ble_config_, &module_config_);

    if (persisted.has_bluetooth)
    {
        bleLogBoth("[BLE][nrf52][mt] loaded bluetooth cfg mode=%u pin=%06lu",
                   static_cast<unsigned>(ble_config_.mode),
                   static_cast<unsigned long>(ble_config_.fixed_pin));
    }
    if (persisted.has_module)
    {
        bleLogBoth("[BLE][nrf52][mt] loaded module cfg mqtt enabled=%u proxy=%u root=%s",
                   module_config_.has_mqtt && module_config_.mqtt.enabled ? 1U : 0U,
                   module_config_.has_mqtt && module_config_.mqtt.proxy_to_client_enabled ? 1U : 0U,
                   module_config_.mqtt.root);
    }

    phone_session_.reset(new phone::meshtastic::MeshtasticPhoneSession(phone_facade_,
                                                                       *this,
                                                                       &phone_facade_,
                                                                       &phone_facade_,
                                                                       &phone_facade_,
                                                                       &phone_facade_,
                                                                       &phone_facade_,
                                                                       &phone_facade_));
}

MeshtasticBleService::~MeshtasticBleService()
{
    stop();
}

void MeshtasticBleService::logFromRadioState(const char* tag) const
{
    const uint32_t head_from_num =
        published_from_radio_count_ > 0 ? published_from_radio_[published_from_radio_head_].frame.from_num : 0;
    bleLogBoth("[BLE][nrf52][mt] fromRadio tag=%s publish_req=%u published=%u head=%u tail=%u "
               "head_from_num=%08lX notify_enabled=%d connected=%d "
               "config_active=%d send_packets=%d",
               tag ? tag : "?",
               from_radio_publish_requested_ ? 1U : 0U,
               static_cast<unsigned>(published_from_radio_count_),
               static_cast<unsigned>(published_from_radio_head_),
               static_cast<unsigned>(published_from_radio_tail_),
               static_cast<unsigned long>(head_from_num),
               from_num_notify_enabled_ ? 1 : 0,
               connected_ ? 1 : 0,
               (phone_session_ && phone_session_->isConfigFlowActive()) ? 1 : 0,
               (phone_session_ && phone_session_->isSendingPackets()) ? 1 : 0);
}

void MeshtasticBleService::logSessionState(const char* tag, uint32_t detail)
{
    const uint32_t now_ms = millis();
    const bool gap_connected = Bluefruit.connected();
    bool bonded = false;
    bool secured = false;
    uint16_t mtu = 0;
    uint16_t interval = 0;
    uint16_t latency = 0;
    uint16_t timeout = 0;
    if (conn_handle_ != BLE_CONN_HANDLE_INVALID)
    {
        BLEConnection* connection = Bluefruit.Connection(conn_handle_);
        if (connection)
        {
            bonded = connection->bonded();
            secured = connection->secured();
            mtu = connection->getMtu();
            interval = connection->getConnectionInterval();
            latency = connection->getSlaveLatency();
            timeout = connection->getSupervisionTimeout();
        }
    }

    bleLogBoth("[BLE][nrf52][mt][session] seq=%lu tag=%s detail=%08lX age_ms=%lu connected=%u gap=%u "
               "secured=%u bonded=%u notify=%u cccd=0x%04X cfg=%u send=%u published=%u head=%u tail=%u "
               "pending_to=%u publish_req=%u mtu=%u ci=%u lat=%u sto=%u "
               "last_sec=%lu last_cccd=%lu last_to=%lu last_hb=%lu last_cfg=%lu last_read=%lu last_notify=%lu",
               static_cast<unsigned long>(ble_session_seq_),
               tag ? tag : "?",
               static_cast<unsigned long>(detail),
               static_cast<unsigned long>(ageSinceOrUnset(now_ms, session_started_ms_)),
               connected_ ? 1U : 0U,
               gap_connected ? 1U : 0U,
               secured ? 1U : 0U,
               bonded ? 1U : 0U,
               from_num_notify_enabled_ ? 1U : 0U,
               conn_handle_ != BLE_CONN_HANDLE_INVALID ? static_cast<unsigned>(from_num_.getCccd(conn_handle_)) : 0U,
               (phone_session_ && phone_session_->isConfigFlowActive()) ? 1U : 0U,
               (phone_session_ && phone_session_->isSendingPackets()) ? 1U : 0U,
               static_cast<unsigned>(published_from_radio_count_),
               static_cast<unsigned>(published_from_radio_head_),
               static_cast<unsigned>(published_from_radio_tail_),
               static_cast<unsigned>(pending_to_radio_count_),
               from_radio_publish_requested_ ? 1U : 0U,
               static_cast<unsigned>(mtu),
               static_cast<unsigned>(interval),
               static_cast<unsigned>(latency),
               static_cast<unsigned>(timeout),
               static_cast<unsigned long>(ageSinceOrUnset(now_ms, last_secured_ms_)),
               static_cast<unsigned long>(ageSinceOrUnset(now_ms, last_from_num_cccd_ms_)),
               static_cast<unsigned long>(ageSinceOrUnset(now_ms, last_to_radio_ms_)),
               static_cast<unsigned long>(ageSinceOrUnset(now_ms, last_heartbeat_ms_)),
               static_cast<unsigned long>(ageSinceOrUnset(now_ms, last_want_config_ms_)),
               static_cast<unsigned long>(ageSinceOrUnset(now_ms, last_from_radio_read_ms_)),
               static_cast<unsigned long>(ageSinceOrUnset(now_ms, last_from_num_notify_ms_)));
}

void MeshtasticBleService::start()
{
    s_active_service = this;
    conn_handle_ = BLE_CONN_HANDLE_INVALID;
    from_num_notify_enabled_ = false;
    pending_to_radio_head_ = 0;
    pending_to_radio_tail_ = 0;
    pending_to_radio_count_ = 0;
    clearToPhoneQueue();
    pending_connect_log_ = false;
    pending_disconnect_log_ = false;
    pending_from_num_cccd_log_ = false;
    pending_pair_complete_log_ = false;
    pending_secured_log_ = false;
    pending_from_radio_auth_log_ = false;
    pending_from_radio_read_log_ = false;
    pending_from_radio_empty_log_ = false;
    pending_from_radio_auth_conn_handle_ = BLE_CONN_HANDLE_INVALID;
    pending_from_radio_auth_offset_ = 0;
    pending_from_radio_auth_chr_ = 0;
    pending_from_radio_auth_svc_ = 0;
    pending_from_radio_empty_reason_ = 0;
    pending_disconnect_reason_ = 0;
    pairing_request_pending_ = false;
    pending_pairing_conn_handle_ = BLE_CONN_HANDLE_INVALID;
    directed_advertising_active_ = false;
    directed_advertising_attempted_ = false;
    directed_advertising_until_ms_ = 0;
    last_ble_activity_ms_ = millis();
    ble_session_seq_ = 0;
    session_started_ms_ = 0;
    last_secured_ms_ = 0;
    last_from_num_cccd_ms_ = 0;
    last_to_radio_ms_ = 0;
    last_heartbeat_ms_ = 0;
    last_want_config_ms_ = 0;
    last_from_radio_read_ms_ = 0;
    last_from_num_notify_ms_ = 0;
    next_connected_session_log_ms_ = 0;
    next_ble_idle_log_ms_ = last_ble_activity_ms_ + 3000UL;

