manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/ble/meshtastic_ble.cpp
    if (phone_session_)
    {
        phone_session_->onIncomingText(msg);
    }
}

void MeshtasticBleService::handleOutgoingTextFromApp(const chat::MeshIncomingText& msg)
{
    if (!phone_session_ || !connected_)
    {
        bleLogBoth("[BLE][nrf52][mt] phone projection skip kind=local_text reason=not-connected from=%08lX id=%08lX",
                   static_cast<unsigned long>(msg.from),
                   static_cast<unsigned long>(msg.msg_id));
        return;
    }

    if (phone_session_)
    {
        Serial2.printf("[BLE][nrf52][mt] local text mirror id=%08lX from=%08lX to=%08lX len=%u\n",
                       static_cast<unsigned long>(msg.msg_id),
                       static_cast<unsigned long>(msg.from),
                       static_cast<unsigned long>(msg.to),
                       static_cast<unsigned>(msg.text.size()));
        phone_session_->onIncomingText(msg);
    }
}

void MeshtasticBleService::handleIncomingDataFromApp(const chat::MeshIncomingData& msg)
{
    if (!phone_session_ || !connected_)
    {
        bleLogBoth("[BLE][nrf52][mt] phone projection skip kind=data reason=not-connected from=%08lX to=%08lX pkt=%08lX port=%u len=%u",
                   static_cast<unsigned long>(msg.from),
                   static_cast<unsigned long>(msg.to),
                   static_cast<unsigned long>(msg.packet_id),
                   static_cast<unsigned>(msg.portnum),
                   static_cast<unsigned>(msg.payload.size()));
        return;
    }

    if (phone_session_)
    {
        bleLogBoth("[BLE][nrf52][mt] onIncomingData from=%08lX to=%08lX pkt=%08lX port=%u len=%u",
                   static_cast<unsigned long>(msg.from),
                   static_cast<unsigned long>(msg.to),
                   static_cast<unsigned long>(msg.packet_id),
                   static_cast<unsigned>(msg.portnum),
                   static_cast<unsigned>(msg.payload.size()));
        probeGpsGuard("ble_incoming_data_pre_session");
        phone_session_->onIncomingData(msg);
        probeGpsGuard("ble_incoming_data_post_session");
    }
}

bool MeshtasticBleService::isRunning() const
{
    return active_ && (Bluefruit.connected() || Bluefruit.Advertising.isRunning());
}

void MeshtasticBleService::setDeviceName(const std::string& name)
{
    device_name_ = name;
}

bool MeshtasticBleService::handleToRadio(const uint8_t* data, size_t len)
{
    last_ble_activity_ms_ = millis();
    last_to_radio_ms_ = last_ble_activity_ms_;
    const uint32_t to_radio_variant = peekToRadioVariant(data, len);
    if (to_radio_variant == meshtastic_ToRadio_heartbeat_tag)
    {
        last_heartbeat_ms_ = last_ble_activity_ms_;
    }
    else if (to_radio_variant == meshtastic_ToRadio_want_config_id_tag)
    {
        last_want_config_ms_ = last_ble_activity_ms_;
    }
    const bool config_before = phone_session_ && phone_session_->isConfigFlowActive();
    const bool send_before = phone_session_ && phone_session_->isSendingPackets();
    probeGpsGuard("ble_to_radio_pre_handle");
    const bool ok = phone_session_ ? phone_session_->handleToRadio(data, len) : false;
    probeGpsGuard("ble_to_radio_post_handle");
    Serial2.printf("[BLE][nrf52][mt] handleToRadio variant=%lu len=%u ok=%u connected=%u notify=%u config=%u->%u send=%u->%u\n",
                   static_cast<unsigned long>(to_radio_variant),
                   static_cast<unsigned>(len),
                   ok ? 1U : 0U,
                   connected_ ? 1U : 0U,
                   from_num_notify_enabled_ ? 1U : 0U,
                   config_before ? 1U : 0U,
                   (phone_session_ && phone_session_->isConfigFlowActive()) ? 1U : 0U,
                   send_before ? 1U : 0U,
                   (phone_session_ && phone_session_->isSendingPackets()) ? 1U : 0U);
    const bool config_after = phone_session_ && phone_session_->isConfigFlowActive();
    const bool send_after = phone_session_ && phone_session_->isSendingPackets();
    if (to_radio_variant == meshtastic_ToRadio_heartbeat_tag)
    {
        logSessionState("heartbeat", to_radio_variant);
    }
    else if (to_radio_variant == meshtastic_ToRadio_want_config_id_tag)
    {
        logSessionState("want_config", to_radio_variant);
    }
    else if (to_radio_variant == meshtastic_ToRadio_disconnect_tag)
    {
        logSessionState("phone_disconnect", to_radio_variant);
    }
    else if (config_before != config_after || send_before != send_after)
    {
        logSessionState("phase_change", to_radio_variant);
    }
    return ok;
}

void MeshtasticBleService::handleFromRadioReadRequest(uint16_t conn_handle,
                                                      uint16_t offset,
                                                      uintptr_t chr_ptr)
{
    pending_from_radio_auth_conn_handle_ = conn_handle;
    pending_from_radio_auth_offset_ = offset;
    pending_from_radio_auth_chr_ = chr_ptr;
    pending_from_radio_auth_svc_ = reinterpret_cast<uintptr_t>(this);
    pending_from_radio_auth_log_ = true;

    if (offset != 0)
    {
        authorizeRead(conn_handle);
        return;
    }

    last_ble_activity_ms_ = millis();
    const bool consumed = writePublishedFromRadioForRead(conn_handle);
    authorizeRead(conn_handle);
    if (consumed)
    {
        last_from_radio_read_ms_ = last_ble_activity_ms_;
        releasePublishedFromRadioHead();
    }
}

void MeshtasticBleService::fillPublishedFromRadioSlots()
{
    if (!active_ || !connected_ || !phone_session_)
    {
        from_radio_publish_requested_ = false;
        return;
    }

    if (!from_radio_publish_requested_)
    {
        return;
    }

    while (published_from_radio_count_ < kPublishedFromRadioCapacity)
    {
        auto& session_frame = session_frame_scratch_;
        std::memset(&session_frame, 0, sizeof(session_frame));
        probeGpsGuard("ble_from_radio_pre_pop");
        if (!phone_session_->popToPhone(&session_frame))
        {
            probeGpsGuard("ble_from_radio_post_pop_empty");
            from_radio_publish_requested_ = false;
            return;
        }
        probeGpsGuard("ble_from_radio_post_pop_frame");

        if (session_frame.len == 0 || session_frame.len > meshtastic_FromRadio_size)
        {
            bleLogBoth("[BLE][nrf52][mt] drop invalid published from_radio frame from_num=%08lX len=%u max=%u",
                       static_cast<unsigned long>(session_frame.from_num),
                       static_cast<unsigned>(session_frame.len),
                       static_cast<unsigned>(meshtastic_FromRadio_size));
            continue;
        }

        const uint8_t slot_index = published_from_radio_tail_;
        PublishedFromRadioSlot& slot = published_from_radio_[slot_index];
        slot.frame = session_frame;
        slot.notified = false;

        noInterrupts();
        published_from_radio_tail_ =
            static_cast<uint8_t>((published_from_radio_tail_ + 1U) % kPublishedFromRadioCapacity);
        ++published_from_radio_count_;
        interrupts();
    }

