manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/ble/meshtastic_ble.cpp
    from_radio_publish_requested_ = true;
}

bool MeshtasticBleService::writePublishedFromRadioForRead(uint16_t conn_handle)
{
    if (!active_ || !connected_ || !phone_session_)
    {
        uint8_t empty = 0;
        probeGpsGuard("ble_from_radio_pre_write_empty_inactive");
        from_radio_.write(&empty, 0);
        probeGpsGuard("ble_from_radio_post_write_empty_inactive");
        pending_from_radio_empty_log_ = true;
        pending_from_radio_empty_reason_ = kFromRadioEmptyInactive;
        return false;
    }

    if (published_from_radio_count_ == 0)
    {
        from_radio_publish_requested_ = true;
        uint8_t empty = 0;
        probeGpsGuard("ble_from_radio_pre_write_empty_no_frame");
        from_radio_.write(&empty, 0);
        probeGpsGuard("ble_from_radio_post_write_empty_no_frame");
        pending_from_radio_empty_log_ = true;
        pending_from_radio_empty_reason_ = kFromRadioEmptyNoFrame;
        return false;
    }

    const uint8_t slot_index = published_from_radio_head_;
    PublishedFromRadioSlot& slot = published_from_radio_[slot_index];
    if (!slot.notified)
    {
        uint8_t empty = 0;
        probeGpsGuard("ble_from_radio_pre_write_empty_not_notified");
        from_radio_.write(&empty, 0);
        probeGpsGuard("ble_from_radio_post_write_empty_not_notified");
        pending_from_radio_empty_log_ = true;
        pending_from_radio_empty_reason_ = kFromRadioEmptyNotNotified;
        return false;
    }

    if (slot.frame.len == 0 || slot.frame.len > meshtastic_FromRadio_size)
    {
        bleLogBoth("[BLE][nrf52][mt] drop invalid published from_radio read slot=%u from_num=%08lX len=%u max=%u",
                   static_cast<unsigned>(slot_index),
                   static_cast<unsigned long>(slot.frame.from_num),
                   static_cast<unsigned>(slot.frame.len),
                   static_cast<unsigned>(meshtastic_FromRadio_size));
        releasePublishedFromRadioHead();
        uint8_t empty = 0;
        probeGpsGuard("ble_from_radio_pre_write_empty_invalid");
        from_radio_.write(&empty, 0);
        probeGpsGuard("ble_from_radio_post_write_empty_invalid");
        pending_from_radio_empty_log_ = true;
        pending_from_radio_empty_reason_ = kFromRadioEmptyInvalidFrame;
        from_radio_publish_requested_ = true;
        return false;
    }

    probeGpsGuard("ble_from_radio_pre_write_frame");
    from_radio_.write(slot.frame.buf, slot.frame.len);
    probeGpsGuard("ble_from_radio_post_write_frame");
    pending_from_radio_read_len_ = static_cast<uint16_t>(slot.frame.len);
    pending_from_radio_read_from_num_ = slot.frame.from_num;
    pending_from_radio_read_log_ = true;
    (void)conn_handle;
    return true;
}

void MeshtasticBleService::releasePublishedFromRadioHead()
{
    if (published_from_radio_count_ == 0)
    {
        return;
    }

    PublishedFromRadioSlot& slot = published_from_radio_[published_from_radio_head_];
    slot.frame.len = 0;
    slot.frame.from_num = 0;
    slot.notified = false;
    noInterrupts();
    published_from_radio_head_ =
        static_cast<uint8_t>((published_from_radio_head_ + 1U) % kPublishedFromRadioCapacity);
    --published_from_radio_count_;
    interrupts();
    from_radio_publish_requested_ = true;
}

bool MeshtasticBleService::enqueueToRadio(const uint8_t* data, size_t len)
{
    if (!data || len == 0 || len > meshtastic_ToRadio_size)
    {
        return false;
    }

    noInterrupts();
    if (pending_to_radio_count_ >= kPendingToRadioCapacity)
    {
        interrupts();
        Serial2.printf("[BLE][nrf52][mt] to_radio queue full len=%u\n", static_cast<unsigned>(len));
        return false;
    }

    PendingToRadioFrame& frame = pending_to_radio_[pending_to_radio_tail_];
    std::memcpy(frame.buf, data, len);
    frame.len = len;
    pending_to_radio_tail_ = static_cast<uint8_t>((pending_to_radio_tail_ + 1U) % kPendingToRadioCapacity);
    ++pending_to_radio_count_;
    interrupts();
    return true;
}

void MeshtasticBleService::processPendingToRadio()
{
    while (true)
    {
        noInterrupts();
        if (pending_to_radio_count_ == 0)
        {
            interrupts();
            return;
        }

        PendingToRadioFrame& frame = pending_to_radio_[pending_to_radio_head_];
        pending_to_radio_work_.len = frame.len;
        std::memcpy(pending_to_radio_work_.buf, frame.buf, frame.len);
        pending_to_radio_head_ = static_cast<uint8_t>((pending_to_radio_head_ + 1U) % kPendingToRadioCapacity);
        --pending_to_radio_count_;
        interrupts();

        (void)handleToRadio(pending_to_radio_work_.buf, pending_to_radio_work_.len);
    }
}

void MeshtasticBleService::processPendingPairingRequest()
{
    if (!pairing_request_pending_)
    {
        return;
    }

    const uint16_t conn_handle = pending_pairing_conn_handle_;
    pairing_request_pending_ = false;
    pending_pairing_conn_handle_ = BLE_CONN_HANDLE_INVALID;
    requestPairingIfNeeded(conn_handle);
}

void MeshtasticBleService::clearToPhoneQueue()
{
    session_frame_scratch_ = phone::meshtastic::MeshtasticBleFrame{};
    for (uint8_t index = 0; index < kPublishedFromRadioCapacity; ++index)
    {
        published_from_radio_[index] = PublishedFromRadioSlot{};
    }
    published_from_radio_head_ = 0;
    published_from_radio_tail_ = 0;
    published_from_radio_count_ = 0;
    from_radio_publish_requested_ = false;
}

void MeshtasticBleService::loadRememberedPhonePeer()
{
    MeshtasticBlePeerIdentity stored{};
    bool from_bond_store = false;
    if (!loadMeshtasticBlePeerIdentity(&stored))
    {
        ble_gap_addr_t bonded_peer{};
        if (!loadFirstPeripheralBondPeer(&bonded_peer))
        {
            bleLogBoth("[BLE][nrf52][mt] remembered peer load none");
            return;
        }

        stored.addr_type = bonded_peer.addr_type;
        stored.bonded = 1;
        std::memcpy(stored.addr, bonded_peer.addr, sizeof(stored.addr));
        from_bond_store = true;
    }

    ble_gap_addr_t peer{};
    peer.addr_type = stored.addr_type;
    std::memcpy(peer.addr, stored.addr, sizeof(peer.addr));
    if (!isIdentityBleAddressType(peer.addr_type) || isEmptyBleAddress(peer))
    {
        char peer_addr_text[24] = {};
        formatBleAddress(peer, peer_addr_text, sizeof(peer_addr_text));
        bleLogBoth("[BLE][nrf52][mt] remembered peer ignored peer=%s type=%s(0x%02X)",
                   peer_addr_text,
                   bleAddressTypeName(peer.addr_type),
                   static_cast<unsigned>(peer.addr_type));
        return;
    }

    remembered_phone_peer_ = peer;
    remembered_phone_peer_valid_ = true;
    remembered_phone_peer_bonded_ = stored.bonded != 0;
    char peer_addr_text[24] = {};
    formatBleAddress(remembered_phone_peer_, peer_addr_text, sizeof(peer_addr_text));
    if (from_bond_store)
    {
        const bool saved = saveMeshtasticBlePeerIdentity(stored);
        bleLogBoth("[BLE][nrf52][mt] remembered peer persisted from bond saved=%u",
                   saved ? 1U : 0U);
    }
    bleLogBoth("[BLE][nrf52][mt] remembered peer loaded source=%s peer=%s type=%s(0x%02X) bonded=%u",
               from_bond_store ? "bond" : "settings",
               peer_addr_text,
               bleAddressTypeName(remembered_phone_peer_.addr_type),
               static_cast<unsigned>(remembered_phone_peer_.addr_type),
               remembered_phone_peer_bonded_ ? 1U : 0U);
}

void MeshtasticBleService::rememberPhonePeer(uint16_t conn_handle, const char* reason)
{
    BLEConnection* connection = Bluefruit.Connection(conn_handle);
    if (!connection)
    {
        bleLogBoth("[BLE][nrf52][mt] remember peer skipped reason=%s conn=%u unavailable",
                   reason ? reason : "?",
                   static_cast<unsigned>(conn_handle));
        return;
    }

