manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/ble/meshtastic_ble.cpp
void MeshtasticBleService::handleFromNumCccdWrite(uint16_t conn_handle, uint16_t value)
{
    conn_handle_ = conn_handle;
    last_ble_activity_ms_ = millis();
    last_from_num_cccd_ms_ = last_ble_activity_ms_;
    from_num_notify_enabled_ = (value != 0U);
    pending_from_num_cccd_conn_handle_ = conn_handle;
    pending_from_num_cccd_value_ = value;
    pending_from_num_cccd_log_ = true;
    bleLogBoth("[BLE][nrf52][mt][flow] from_num subscribed=%u conn=%u value=0x%04X",
               from_num_notify_enabled_ ? 1U : 0U,
               static_cast<unsigned>(conn_handle),
               static_cast<unsigned>(value));
    logSessionState(from_num_notify_enabled_ ? "from_num_cccd_on" : "from_num_cccd_off", value);
}

void MeshtasticBleService::handlePairPasskeyDisplay(uint16_t conn_handle, const uint8_t passkey[6], bool match_request)
{
    const uint32_t parsed = parsePasskeyDigits(passkey);
    pending_passkey_.store(parsed);
    const uint32_t configured = configured_passkey_.load();
    bleLogBoth("[BLE][nrf52][mt][flow] passkey-display conn=%u passkey=%06lu configured=%06lu match=%u consistent=%u",
               static_cast<unsigned>(conn_handle),
               static_cast<unsigned long>(parsed),
               static_cast<unsigned long>(configured),
               match_request ? 1U : 0U,
               (configured == 0 || configured == parsed) ? 1U : 0U);
}

void MeshtasticBleService::handlePairComplete(uint16_t conn_handle, uint8_t auth_status)
{
    pending_passkey_.store(0);
    pending_pair_complete_conn_handle_ = conn_handle;
    pending_pair_complete_status_ = auth_status;
    pending_pair_complete_log_ = true;
    bleLogBoth("[BLE][nrf52][mt][flow] pair-complete conn=%u status=0x%02X(%s)",
               static_cast<unsigned>(conn_handle),
               static_cast<unsigned>(auth_status),
               gapSecurityStatusName(auth_status));
    if (auth_status == BLE_GAP_SEC_STATUS_SUCCESS)
    {
        rememberPhonePeer(conn_handle, "pair");
    }
}

void MeshtasticBleService::handleSecured(uint16_t conn_handle)
{
    pending_passkey_.store(0);
    pending_secured_conn_handle_ = conn_handle;
    pending_secured_log_ = true;
    last_secured_ms_ = millis();
    BLEConnection* connection = Bluefruit.Connection(conn_handle);
    bleLogBoth("[BLE][nrf52][mt][flow] secured conn=%u bonded=%u secured=%u mtu=%u",
               static_cast<unsigned>(conn_handle),
               connection && connection->bonded() ? 1U : 0U,
               connection && connection->secured() ? 1U : 0U,
               connection ? static_cast<unsigned>(connection->getMtu()) : 0U);
    logSessionState("secured");
    rememberPhonePeer(conn_handle, "secured");
}

bool MeshtasticBleService::getPairingStatus(BlePairingStatus* out) const
{
    if (!out)
    {
        return false;
    }

    *out = BlePairingStatus{};
    out->available = phone_facade_.isBleEnabled();
    out->requires_passkey = ble_config_.mode != meshtastic_Config_BluetoothConfig_PairingMode_NO_PIN;
    out->is_fixed_pin = ble_config_.mode == meshtastic_Config_BluetoothConfig_PairingMode_FIXED_PIN;
    out->is_connected = isBleConnected();
    out->passkey = effectivePasskey();
    out->is_pairing_active = out->requires_passkey && out->passkey != 0;
    return true;
}

bool MeshtasticBleService::isBleConnected() const
{
    return connected_ && Bluefruit.connected();
}

bool MeshtasticBleService::isPhoneBleConnected() const
{
    return isBleConnected();
}

uint32_t MeshtasticBleService::pendingPhoneBlePasskey() const
{
    return effectivePasskey();
}

void MeshtasticBleService::requestPhoneHighThroughputConnection()
{
}

void MeshtasticBleService::requestPhoneLowerPowerConnection()
{
}

void MeshtasticBleService::onPhoneBluetoothConfigChanged()
{
    markConfigSavePending(true, false);
    bleLogBoth("[BLE][nrf52][mt] saveBluetoothConfig requested mode=%u pin=%06lu enabled=%u",
               static_cast<unsigned>(ble_config_.mode),
               static_cast<unsigned long>(ble_config_.fixed_pin),
               ble_config_.enabled ? 1U : 0U);
    flushPendingConfigSaves(true);
}

void MeshtasticBleService::onPhoneModuleConfigChanged()
{
    markConfigSavePending(false, true);
    syncMqttProxySettings();
    bleLogBoth("[BLE][nrf52][mt] saveModuleConfig requested");
    flushPendingConfigSaves(true);
}

void MeshtasticBleService::notifyFromNum(uint32_t from_num)
{
    if (!active_ || !connected_ || !phone_session_)
    {
        bleLogBoth("[BLE][nrf52][mt][flow] from_radio publish request source=%08lX skip inactive active=%u connected=%u",
                   static_cast<unsigned long>(from_num),
                   active_ ? 1U : 0U,
                   connected_ ? 1U : 0U);
        return;
    }

    from_radio_publish_requested_ = true;

    bleLogBoth("[BLE][nrf52][mt][flow] from_radio publish request source=%08lX published=%u head=%u tail=%u",
               static_cast<unsigned long>(from_num),
               static_cast<unsigned>(published_from_radio_count_),
               static_cast<unsigned>(published_from_radio_head_),
               static_cast<unsigned>(published_from_radio_tail_));
}

void MeshtasticBleService::flushPendingFromNumNotify()
{
    fillPublishedFromRadioSlots();

    if (!active_ || !connected_)
    {
        if (published_from_radio_count_ > 0 || from_radio_publish_requested_)
        {
            bleLogBoth("[BLE][nrf52][mt][flow] from_num skip reason=inactive active=%u connected=%u published=%u",
                       active_ ? 1U : 0U,
                       connected_ ? 1U : 0U,
                       static_cast<unsigned>(published_from_radio_count_));
        }
        clearToPhoneQueue();
        return;
    }

    if (published_from_radio_count_ == 0)
    {
        return;
    }

    if (!from_num_notify_enabled_ || conn_handle_ == BLE_CONN_HANDLE_INVALID)
    {
        return;
    }

    const uint8_t slot_index = published_from_radio_head_;
    PublishedFromRadioSlot& slot = published_from_radio_[slot_index];
    if (slot.notified)
    {
        return;
    }

    const uint32_t from_num = slot.frame.from_num;
    if (slot.frame.len == 0 || slot.frame.len > meshtastic_FromRadio_size)
    {
        bleLogBoth("[BLE][nrf52][mt][flow] from_num drop invalid published slot=%u from_num=%08lX len=%u",
                   static_cast<unsigned>(slot_index),
                   static_cast<unsigned long>(from_num),
                   static_cast<unsigned>(slot.frame.len));
        slot.frame.len = 0;
        slot.frame.from_num = 0;
        slot.notified = false;
        noInterrupts();
        published_from_radio_head_ =
            static_cast<uint8_t>((published_from_radio_head_ + 1U) % kPublishedFromRadioCapacity);
        --published_from_radio_count_;
        interrupts();
        from_radio_publish_requested_ = true;
        return;
    }

    probeGpsGuard("ble_from_num_pre_write");
    from_num_.write32(from_num);
    probeGpsGuard("ble_from_num_post_write");
    probeGpsGuard("ble_from_num_pre_notify");
    const bool ok = from_num_.notify32(conn_handle_, from_num);
    probeGpsGuard("ble_from_num_post_notify");
    bleLogBoth("[BLE][nrf52][mt][flow] from_num notify slot=%u value=%08lX conn=%u ok=%u cccd=0x%04X q=%u",
               static_cast<unsigned>(slot_index),
               static_cast<unsigned long>(from_num),
               static_cast<unsigned>(conn_handle_),
               ok ? 1U : 0U,
               static_cast<unsigned>(from_num_.getCccd(conn_handle_)),
               static_cast<unsigned>(published_from_radio_count_));
    if (ok)
    {
        last_from_num_notify_ms_ = millis();
        slot.notified = true;
        return;
    }
    if (!ok && Bluefruit.connected())
    {
        probeGpsGuard("ble_from_num_pre_notify_fallback");
        const bool fallback_ok = from_num_.notify32(from_num);
        probeGpsGuard("ble_from_num_post_notify_fallback");
        bleLogBoth("[BLE][nrf52][mt][flow] from_num notify fallback slot=%u ok=%u",
                   static_cast<unsigned>(slot_index),
                   fallback_ok ? 1U : 0U);
        if (fallback_ok)
        {
            last_from_num_notify_ms_ = millis();
            slot.notified = true;
        }
    }
}

