manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/ble/meshtastic_ble.cpp
void MeshtasticBleService::markConfigSavePending(bool bluetooth_changed, bool module_changed)
{
    if (bluetooth_changed)
    {
        bluetooth_config_save_pending_ = true;
    }
    if (module_changed)
    {
        module_config_save_pending_ = true;
    }
    config_save_due_ms_ = millis() + kConfigSaveDebounceMs;
}

void MeshtasticBleService::flushPendingConfigSaves(bool force)
{
    if (!bluetooth_config_save_pending_ && !module_config_save_pending_)
    {
        return;
    }

    const uint32_t now_ms = millis();
    if (!force)
    {
        if (phone_session_ && phone_session_->isConfigFlowActive())
        {
            return;
        }
        if (static_cast<int32_t>(now_ms - config_save_due_ms_) < 0)
        {
            return;
        }
        if (connected_ && (now_ms - last_ble_activity_ms_) < kConfigSaveDebounceMs)
        {
            return;
        }
    }

    meshtastic_Config_BluetoothConfig persisted_bluetooth = ble_config_;
    meshtastic_config_bridge::normalizeBluetoothConfig(&persisted_bluetooth);
    persisted_bluetooth.enabled = phone_facade_.isBleEnabled();
    meshtastic_LocalModuleConfig persisted_module = module_config_;
    meshtastic_config_bridge::normalizeModuleConfig(&persisted_module);
    const bool needs_save = bluetooth_config_save_pending_ || module_config_save_pending_;
    const bool persisted = needs_save ? saveMeshtasticBlePersistedState(persisted_bluetooth, persisted_module) : true;
    ble_config_.enabled = persisted_bluetooth.enabled;

    bleLogBoth("[BLE][nrf52][mt] current mem persisted=%u bluetooth_config_save_pending_=%u module_config_save_pending_=%u needs_save=%u",
               persisted ? 1U : 0U,
               bluetooth_config_save_pending_ ? 1U : 0U,
               module_config_save_pending_ ? 1U : 0U,
               needs_save ? 1U : 0U);

    if (bluetooth_config_save_pending_)
    {
        bleLogBoth("[BLE][nrf52][mt] flush bluetooth cfg persisted=%u mode=%u pin=%06lu enabled=%u",
                   persisted ? 1U : 0U,
                   static_cast<unsigned>(persisted_bluetooth.mode),
                   static_cast<unsigned long>(persisted_bluetooth.fixed_pin),
                   persisted_bluetooth.enabled ? 1U : 0U);
        if (persisted)
        {
            bluetooth_config_save_pending_ = false;
        }
    }

    if (module_config_save_pending_)
    {
        bleLogBoth("[BLE][nrf52][mt] flush module cfg persisted=%u enabled=%u proxy=%u root=%s",
                   persisted ? 1U : 0U,
                   module_config_.has_mqtt && module_config_.mqtt.enabled ? 1U : 0U,
                   module_config_.has_mqtt && module_config_.mqtt.proxy_to_client_enabled ? 1U : 0U,
                   module_config_.mqtt.root);
        if (persisted)
        {
            module_config_save_pending_ = false;
        }
    }

    if (!persisted)
    {
        config_save_due_ms_ = millis() + kConfigSaveDebounceMs;
    }
}

void MeshtasticBleService::syncMqttProxySettings()
{
    phone_facade_.syncMeshtasticMqttProxySettings(module_config_);
}

void MeshtasticBleService::applyBleSecurity()
{
    pending_passkey_.store(0);
    configured_passkey_.store(0);

    if (ble_config_.mode == meshtastic_Config_BluetoothConfig_PairingMode_NO_PIN)
    {
        const bool clear_pin_ok = clearSoftDeviceBlePasskey();
        Bluefruit.Security.setMITM(false);
        Bluefruit.Security.setIOCaps(false, false, false);
        Bluefruit.Security.setPairPasskeyCallback(nullptr);
        Bluefruit.Security.setPairCompleteCallback(nullptr);
        Bluefruit.Security.setSecuredCallback(nullptr);
        bleLogBoth("[BLE][nrf52][mt] security mode=no_pin clear_pin=%u", clear_pin_ok ? 1U : 0U);
        return;
    }

    uint32_t pairing_pin = 0;
    const char* mode_name = "random_pin";
    if (ble_config_.mode == meshtastic_Config_BluetoothConfig_PairingMode_FIXED_PIN)
    {
        pairing_pin = ble_config_.fixed_pin != 0 ? ble_config_.fixed_pin : kDefaultBleFixedPin;
        ble_config_.fixed_pin = pairing_pin;
        mode_name = "fixed";
    }
    else
    {
        pairing_pin = generateBlePairingPasskey();
    }

    char digits[7] = {};
    formatBlePasskey(pairing_pin, digits);
    configured_passkey_.store(pairing_pin);
    const bool set_pin_ok = Bluefruit.Security.setPIN(digits);
    Bluefruit.Security.setIOCaps(true, false, false);
    Bluefruit.Security.setMITM(true);
    Bluefruit.Security.setPairPasskeyCallback(onPairPasskeyDisplay);
    Bluefruit.Security.setPairCompleteCallback(onPairComplete);
    Bluefruit.Security.setSecuredCallback(onSecured);
    bleLogBoth("[BLE][nrf52][mt] security mode=%s pin=%s set_pin=%u",
               mode_name,
               digits,
               set_pin_ok ? 1U : 0U);
}

void MeshtasticBleService::requestPairingIfNeeded(uint16_t conn_handle)
{
    if (ble_config_.mode == meshtastic_Config_BluetoothConfig_PairingMode_NO_PIN)
    {
        return;
    }
    Serial2.printf("[BLE][nrf52][mt] pairing wait-for-central conn=%u mode=%u\n",
                   static_cast<unsigned>(conn_handle),
                   static_cast<unsigned>(ble_config_.mode));
}

void MeshtasticBleService::logDeferredBleEvents()
{
    if (pending_connect_log_)
    {
        pending_connect_log_ = false;
        bleLogBoth("[BLE][nrf52][mt] connected conn=%u mode=%u",
                   static_cast<unsigned>(pending_connect_conn_handle_),
                   static_cast<unsigned>(ble_config_.mode));
    }

    if (pending_disconnect_log_)
    {
        pending_disconnect_log_ = false;
        bleLogBoth("[BLE][nrf52][mt] disconnected conn=%u reason=0x%02X(%s)",
                   static_cast<unsigned>(pending_disconnect_conn_handle_),
                   static_cast<unsigned>(pending_disconnect_reason_),
                   disconnectReasonName(pending_disconnect_reason_));
    }

    if (pending_from_num_cccd_log_)
    {
        pending_from_num_cccd_log_ = false;
        bleLogBoth("[BLE][nrf52][mt] from_num cccd conn=%u value=0x%04X enabled=%u",
                   static_cast<unsigned>(pending_from_num_cccd_conn_handle_),
                   static_cast<unsigned>(pending_from_num_cccd_value_),
                   from_num_notify_enabled_ ? 1U : 0U);
    }

    if (pending_pair_complete_log_)
    {
        pending_pair_complete_log_ = false;
        bleLogBoth("[BLE][nrf52][mt] pair complete status=0x%02X(%s) conn=%u",
                   static_cast<unsigned>(pending_pair_complete_status_),
                   disconnectReasonName(pending_pair_complete_status_),
                   static_cast<unsigned>(pending_pair_complete_conn_handle_));
    }

    if (pending_secured_log_)
    {
        pending_secured_log_ = false;
        bleLogBoth("[BLE][nrf52][mt] secured conn=%u",
                   static_cast<unsigned>(pending_secured_conn_handle_));
    }

    if (pending_from_radio_auth_log_)
    {
        pending_from_radio_auth_log_ = false;
        bleLogBoth("[BLE][nrf52][mt][auth] conn=%u offset=%u chr=%p svc=%p",
                   static_cast<unsigned>(pending_from_radio_auth_conn_handle_),
                   static_cast<unsigned>(pending_from_radio_auth_offset_),
                   reinterpret_cast<void*>(static_cast<uintptr_t>(pending_from_radio_auth_chr_)),
                   reinterpret_cast<void*>(static_cast<uintptr_t>(pending_from_radio_auth_svc_)));
    }

    if (pending_from_radio_read_log_)
    {
        pending_from_radio_read_log_ = false;
        bleLogBoth("[BLE][nrf52][mt] from_radio read seq=%lu len=%u from_num=%08lX",
                   static_cast<unsigned long>(ble_session_seq_),
                   static_cast<unsigned>(pending_from_radio_read_len_),
                   static_cast<unsigned long>(pending_from_radio_read_from_num_));
    }

    if (pending_from_radio_empty_log_)
    {
        pending_from_radio_empty_log_ = false;
        bleLogBoth("[BLE][nrf52][mt] from_radio read empty seq=%lu reason=%s config_active=%u send_packets=%u connected=%u",
                   static_cast<unsigned long>(ble_session_seq_),
                   fromRadioEmptyReasonName(pending_from_radio_empty_reason_),
                   (phone_session_ && phone_session_->isConfigFlowActive()) ? 1U : 0U,
                   (phone_session_ && phone_session_->isSendingPackets()) ? 1U : 0U,
                   connected_ ? 1U : 0U);
    }
}

uint32_t MeshtasticBleService::effectivePasskey() const
{
    const uint32_t pending = pending_passkey_.load();
    if (pending != 0)
    {
        return pending;
    }

    if (isBleConnected())
    {
        return 0;
    }

    if (ble_config_.mode == meshtastic_Config_BluetoothConfig_PairingMode_FIXED_PIN)
    {
        return ble_config_.fixed_pin;
    }
    if (ble_config_.mode == meshtastic_Config_BluetoothConfig_PairingMode_RANDOM_PIN)
    {
        return configured_passkey_.load();
    }
    return 0;
}

} // namespace ble
